In [56]:
import pandas as pd
import numpy as np
people = {
    'first': ['Corey', 'Jane', 'John', 'Chris', np.nan, None, 'NA'], 
    'last': ['Schafer', 'Doe', 'Doe', 'Schafer', np.nan, np.nan, 'Missing'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com', None, np.nan, 'Anonymous@email.com', 'NA'],
    'age': ['33', '55', '63', '36', None, None, 'Missing']
}

In [57]:
# create DataFrame object
# keys are columns 
# lists of something are rows
df = pd.DataFrame(people)
df

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
4    NaN      NaN                      NaN     None
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [58]:
df.columns

Index(['first', 'last', 'email', 'age'], dtype='object')

In [59]:
df[['first', 'last']] # returns pandas.core.frame.DataFrame

   first     last
0  Corey  Schafer
1   Jane      Doe
2   John      Doe
3  Chris  Schafer
4    NaN      NaN
5   None      NaN
6     NA  Missing

In [60]:
df.iloc[0] # access the single row

df.iloc[[0, 1]] # access multiple rows
 
df.iloc[[0, 1], [2, 1]] # first param - rows
                        # second param  - cols

                     email     last
0  CoreyMSchafer@gmail.com  Schafer
1        JaneDoe@email.com      Doe

In [61]:
df.loc[[0, 1], ['email', 'last']] # same as iloc but takes string args for second param

                     email     last
0  CoreyMSchafer@gmail.com  Schafer
1        JaneDoe@email.com      Doe

In [62]:
# PART 4 indexes and conditionals

# set index column 
df.set_index('email') # change once
df.set_index('email', inplace=True) # change forever
df.index # nice unique identifier for the row

Index(['CoreyMSchafer@gmail.com',       'JaneDoe@email.com',
             'JohnDoe@email.com',                      None,
                             nan,     'Anonymous@email.com',
                            'NA'],
      dtype='object', name='email')

In [63]:
df.loc['CoreyMSchafer@gmail.com'] # we replaced default indexes with strings
                                  # and now the 1st arg is a string cant do df.loc[0]

first      Corey
last     Schafer
age           33
Name: CoreyMSchafer@gmail.com, dtype: object

In [64]:
df.reset_index(inplace=True) # reset index assignment

In [65]:
filt = (df['last'] == 'Doe') & (df['first'] == 'John')
df[filt]

               email first last age
2  JohnDoe@email.com  John  Doe  63

In [66]:
df.loc[filt, 'email'] # 1st rows that we want, 2nd columns that we want

2    JohnDoe@email.com
Name: email, dtype: object

In [67]:
# PART 5 Updating rows and columns - modifying data withing the data frame

# replace columns in order
# df.columns = ['first_name', 'last_name', 'email']

In [68]:
# use list comprehensions
df.columns = [x.lower() for x in df.columns]
df

                     email  first     last      age
0  CoreyMSchafer@gmail.com  Corey  Schafer       33
1        JaneDoe@email.com   Jane      Doe       55
2        JohnDoe@email.com   John      Doe       63
3                     None  Chris  Schafer       36
4                      NaN    NaN      NaN     None
5      Anonymous@email.com   None      NaN     None
6                       NA     NA  Missing  Missing

In [69]:
# replace something in columns
df.columns = df.columns.str.replace('_', ' ') # replace all underscores with spaces vice versa
df.columns = df.columns.str.replace(' ', '_')

In [70]:
# rename columns 
df.rename(columns={'first_name' : 'first', 'last_name' : 'last'}, inplace=True)
df

                     email  first     last      age
0  CoreyMSchafer@gmail.com  Corey  Schafer       33
1        JaneDoe@email.com   Jane      Doe       55
2        JohnDoe@email.com   John      Doe       63
3                     None  Chris  Schafer       36
4                      NaN    NaN      NaN     None
5      Anonymous@email.com   None      NaN     None
6                       NA     NA  Missing  Missing

In [71]:
df.loc[2] = ['John', 'Smith', 'John@email.com']

ValueError: could not broadcast input array from shape (3,) into shape (4,)

In [ ]:
# change only particular values if we do not want to modify all of them 
df.loc[2, ['last', 'email']] = ['Doe', 'JohnDoe@email.com'] # we can change as list or string for the 2nd param
df

                     first   last              email
0  CoreyMSchafer@gmail.com  Corey            Schafer
1        JaneDoe@email.com   Jane                Doe
2                     John    Doe  JohnDoe@email.com
3             Adam@kek.com   Adam          Adamovich

In [ ]:
# we can not assign it like this because the copy is returned
# filt = (df['email'] == 'JohnDoe@email.com')
# df[filt]['last'] = 'Smith'

# instead we should use loc or iloc 
filt = (df['email'] == 'JohnDoe@email.com')
df.loc[filt, 'last'] = 'Smith'
df

                     first   last              email
0  CoreyMSchafer@gmail.com  Corey            Schafer
1        JaneDoe@email.com   Jane                Doe
2                     John  Smith  JohnDoe@email.com
3             Adam@kek.com   Adam          Adamovich

In [ ]:
df['email'] = df['email'].str.lower()
df

                     first   last              email
0  CoreyMSchafer@gmail.com  Corey            schafer
1        JaneDoe@email.com   Jane                doe
2                     John  Smith  johndoe@email.com
3             Adam@kek.com   Adam          adamovich

In [ ]:
df['email'].apply(len)

0     7
1     3
2    17
3     9
Name: email, dtype: int64

In [ ]:
def update_email(email):
    return email.upper()

df['email'].apply(str.lower)
df['email'].apply(str.upper)

# or pass custom functions ... 
# to actually modify values, we can just assign them
df['email'] = df['email'].apply(update_email)
df

                     first   last              email
0  CoreyMSchafer@gmail.com  Corey            SCHAFER
1        JaneDoe@email.com   Jane                DOE
2                     John  Smith  JOHNDOE@EMAIL.COM
3             Adam@kek.com   Adam          ADAMOVICH

In [ ]:
df['email'] = df['email'].apply(lambda x: x.lower())
df

                     first   last              email
0  CoreyMSchafer@gmail.com  Corey            schafer
1        JaneDoe@email.com   Jane                doe
2                     John  Smith  johndoe@email.com
3             Adam@kek.com   Adam          adamovich

In [ ]:
df.applymap(len)
# df.applymap(str.lower)

   first  last  email
0     23     5      7
1     17     4      3
2      4     5     17
3     12     4      9

In [ ]:
df = pd.DataFrame(people)
df['first'].map({'Corey' : 'Chris', 'Ja ne' : 'Mary'})

0    Chris
1      NaN
2      NaN
3      NaN
Name: first, dtype: object

In [ ]:
df['first'].replace({'Corey' : 'Chris', 'Ja ne' : 'Mary'}, )

0    Chris
1     Jane
2     John
3     Adam
Name: first, dtype: object

In [ ]:
# Part 6 Add/remove columns

# adding new columns
df['full_name'] = df['first']  + ' ' + df['last'] 
df

   first       last                    email       full_name
0  Corey    Schafer  CoreyMSchafer@gmail.com   Corey Schafer
1   Jane        Doe        JaneDoe@email.com        Jane Doe
2   John        Doe        JohnDoe@email.com        John Doe
3   Adam  Adamovich             Adam@kek.com  Adam Adamovich

In [ ]:
# remove columns
df.drop(columns=['first', 'last'])
df

   first       last                    email       full_name
0  Corey    Schafer  CoreyMSchafer@gmail.com   Corey Schafer
1   Jane        Doe        JaneDoe@email.com        Jane Doe
2   John        Doe        JohnDoe@email.com        John Doe
3   Adam  Adamovich             Adam@kek.com  Adam Adamovich

In [ ]:
df['full_name'].str.split(' ', expand=True) # expand - return dataframe instead of returned lst

       0          1
0  Corey    Schafer
1   Jane        Doe
2   John        Doe
3   Adam  Adamovich

In [ ]:
# add rows and deleting rows
df.append({'first' : 'Tony'}, ignore_index=True)

C:\Users\mosek\AppData\Local\Temp\ipykernel_15424\3738067416.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'first' : 'Tony'}, ignore_index=True)

   first       last                    email       full_name
0  Corey    Schafer  CoreyMSchafer@gmail.com   Corey Schafer
1   Jane        Doe        JaneDoe@email.com        Jane Doe
2   John        Doe        JohnDoe@email.com        John Doe
3   Adam  Adamovich             Adam@kek.com  Adam Adamovich
4   Tony        NaN                      NaN             NaN

In [ ]:
people = {
    "first": ["Tony", 'Steve'], 
    "last": ["Stark", 'Rogers'], 
    "email": ["IronMan@avenge.com", 'Cap@avenge.com']
}
df2 = pd.DataFrame(people)
df2

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [ ]:
# append another table to the current data frame

# df.append(df2, ignore_index=True, sort=False)

# make changes permanent
df = df.append(df2, ignore_index=True, sort=False) 
df

C:\Users\mosek\AppData\Local\Temp\ipykernel_15424\1347280340.py:6: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df2, ignore_index=True, sort=False)

   first       last                    email       full_name
0  Corey    Schafer  CoreyMSchafer@gmail.com   Corey Schafer
1   Jane        Doe        JaneDoe@email.com        Jane Doe
2   John        Doe        JohnDoe@email.com        John Doe
3   Adam  Adamovich             Adam@kek.com  Adam Adamovich
4   Tony      Stark       IronMan@avenge.com             NaN
5  Steve     Rogers           Cap@avenge.com             NaN

In [ ]:
df.drop_duplicates(inplace=True) # remove all duplicates
df

   first       last                    email       full_name
0  Corey    Schafer  CoreyMSchafer@gmail.com   Corey Schafer
1   Jane        Doe        JaneDoe@email.com        Jane Doe
2   John        Doe        JohnDoe@email.com        John Doe
3   Adam  Adamovich             Adam@kek.com  Adam Adamovich
4   Tony      Stark       IronMan@avenge.com             NaN
5  Steve     Rogers           Cap@avenge.com             NaN

In [ ]:
# drop with conditional
filt = df['last'] == 'Doe'
df.drop(index=df[filt].index)

# update rows
df.loc[[3, 4], 'full_name'] = 'Tony Stark'
df

   first       last                    email      full_name
0  Corey    Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane        Doe        JaneDoe@email.com       Jane Doe
2   John        Doe        JohnDoe@email.com       John Doe
3   Adam  Adamovich             Adam@kek.com     Tony Stark
4   Tony      Stark       IronMan@avenge.com     Tony Stark
5  Steve     Rogers           Cap@avenge.com            NaN

In [ ]:
# Partd 7 Sorting Data

# sort by key
# df.sort_values(by='last') # we pass ascending=False

In [ ]:
# pass list of bool values 
df.sort_values(by=['first', 'last'], ascending=[True, True], inplace=False)

   first       last                    email      full_name
3   Adam  Adamovich             Adam@kek.com     Tony Stark
0  Corey    Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane        Doe        JaneDoe@email.com       Jane Doe
2   John        Doe        JohnDoe@email.com       John Doe
5  Steve     Rogers           Cap@avenge.com            NaN
4   Tony      Stark       IronMan@avenge.com     Tony Stark

In [ ]:
# undo previous sorting
df.sort_index()
df

   first       last                    email      full_name
0  Corey    Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane        Doe        JaneDoe@email.com       Jane Doe
2   John        Doe        JohnDoe@email.com       John Doe
3   Adam  Adamovich             Adam@kek.com     Tony Stark
4   Tony      Stark       IronMan@avenge.com     Tony Stark
5  Steve     Rogers           Cap@avenge.com            NaN

In [73]:
import pandas as pd
import numpy as np
people = {
    'first': ['Corey', 'Jane', 'John', 'Chris', np.nan, None, 'NA'], 
    'last': ['Schafer', 'Doe', 'Doe', 'Schafer', np.nan, np.nan, 'Missing'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com', None, np.nan, 'Anonymous@email.com', 'NA'],
    'age': ['33', '55', '63', '36', None, None, 'Missing']
}

In [77]:
# Draop all NA values
# index - drop rows with na values, columns - drop columns with na values
# any - drop any rows with na values, all - drop if all values are missing
df.dropna(axis='columns', how='all')

                     email  first     last      age
0  CoreyMSchafer@gmail.com  Corey  Schafer       33
1        JaneDoe@email.com   Jane      Doe       55
2        JohnDoe@email.com   John      Doe       63
3                     None  Chris  Schafer       36
4                      NaN    NaN      NaN     None
5      Anonymous@email.com   None      NaN     None
6                       NA     NA  Missing  Missing

In [78]:
# replace all na values with a string
df.fillna('MISSING')

                     email    first     last      age
0  CoreyMSchafer@gmail.com    Corey  Schafer       33
1        JaneDoe@email.com     Jane      Doe       55
2        JohnDoe@email.com     John      Doe       63
3                  MISSINg    Chris  Schafer       36
4                  MISSINg  MISSINg  MISSINg  MISSINg
5      Anonymous@email.com  MISSINg  MISSINg  MISSINg
6                       NA       NA  Missing  Missing